# This program creates 4 Dataframes 1. Area 2. Item, 3. Element and 4. Emission. Finally load those Dataframes into Postgres

In [32]:
#Import Libraries
import pandas as pd 
import os 
import csv 
from sqlalchemy import create_engine
from config import db_password
import psycopg2

In [83]:
#  Create a DataFrame for the Normalized data
Normalized_df=pd.read_csv('Emission_Normalized_Data.csv')
Normalized_df.head()

,Area_Code,Area,Item_Code,Item,Element_Code,Element,Year,Emission
0,2,Afghanistan,5058,Enteric Fermentation,7225,Emissions (CH4),1990,178.4682
1,2,Afghanistan,5058,Enteric Fermentation,724413,Emissions (CO2eq) from CH4 (AR5),1990,4997.1108
2,2,Afghanistan,5058,Enteric Fermentation,723113,Emissions (CO2eq) (AR5),1990,4997.1108
3,2,Afghanistan,5059,Manure Management,7225,Emissions (CH4),1990,8.5165
4,2,Afghanistan,5059,Manure Management,7230,Emissions (N2O),1990,0.3046

# Create the Country Table DataFrame

In [84]:
# Drop unwanted columns
Area_df = Normalized_df.drop(["Item_Code", "Item","Element_Code", "Element", "Year", "Emission"], axis=1)
Area_df.head()

   Area_Code         Area
0          2  Afghanistan
1          2  Afghanistan
2          2  Afghanistan
3          2  Afghanistan
4          2  Afghanistan

In [85]:
#Drop the duplicates
Area_table_df = Area_df.drop_duplicates()


Area_table_df.head()

     Area_Code            Area
0            2     Afghanistan
113          3         Albania
232          4         Algeria
345          5  American Samoa
407          6         Andorra

In [87]:
#Save the df in to a CSV
Area_table_df.to_csv("Area.csv",header=True,index=False,mode="w")

In [76]:
#Check the no of rows
Area_df.count()

Area    905640
dtype: int64

# Create the Item Table DataFrame

In [88]:
#Drop the unwanted columns
Item_df = Normalized_df.drop(["Area", "Area_Code", "Element_Code", "Element", "Year", "Emission"], axis=1)
Item_df.head()

   Item_Code                  Item
0       5058  Enteric Fermentation
1       5058  Enteric Fermentation
2       5058  Enteric Fermentation
3       5059     Manure Management
4       5059     Manure Management

In [40]:
#Check the no of records
Item_df.count()

Item    905640
dtype: int64

In [89]:
#Drop the duplicates
Item_df = Item_df.drop_duplicates()
Item_df.head()

    Item_Code                     Item
0        5058     Enteric Fermentation
3        5059        Manure Management
8        5060         Rice Cultivation
11       5061    Synthetic Fertilizers
16       5062  Manure applied to Soils

In [90]:
#Save the df into a CSV
Item_df.to_csv("Item.csv",header=True,index=False,mode="w")

# Create the Element Table DataFrame

In [91]:
#Drop the inwanted columns
Element_df = Normalized_df.drop(["Item_Code", "Area", "Area_Code", "Item", "Year", "Emission"], axis=1)
Element_df.head()

   Element_Code                           Element
0          7225                   Emissions (CH4)
1        724413  Emissions (CO2eq) from CH4 (AR5)
2        723113           Emissions (CO2eq) (AR5)
3          7225                   Emissions (CH4)
4          7230                   Emissions (N2O)

In [92]:
#Drop the duplicates
Element_table_df = Element_df.drop_duplicates()
Element_table_df.head()

   Element_Code                           Element
0          7225                   Emissions (CH4)
1        724413  Emissions (CO2eq) from CH4 (AR5)
2        723113           Emissions (CO2eq) (AR5)
4          7230                   Emissions (N2O)
6        724313  Emissions (CO2eq) from N2O (AR5)

In [93]:
#Save the df into a CSV
Element_table_df.to_csv("Element.csv",header=True,index=False,mode="w")

In [94]:
#Check the no of records
Element_table_df.count()

Element_Code    8
Element         8
dtype: int64

# Create the Emission Table DataFrame

In [100]:
#Create a data frame for the Normalized data
Normalized_df=pd.read_csv('Emission_Normalized_Data.csv')
Normalized_df.head()

,Area_Code,Area,Item_Code,Item,Element_Code,Element,Year,Emission
0,2,Afghanistan,5058,Enteric Fermentation,7225,Emissions (CH4),1990,178.4682
1,2,Afghanistan,5058,Enteric Fermentation,724413,Emissions (CO2eq) from CH4 (AR5),1990,4997.1108
2,2,Afghanistan,5058,Enteric Fermentation,723113,Emissions (CO2eq) (AR5),1990,4997.1108
3,2,Afghanistan,5059,Manure Management,7225,Emissions (CH4),1990,8.5165
4,2,Afghanistan,5059,Manure Management,7230,Emissions (N2O),1990,0.3046

In [101]:
#Drop the unwanted columns
Emission_df = Normalized_df.drop([ "Item", "Element"], axis=1)
Emission_df.head()

   Area_Code         Area  Item_Code  Element_Code  Year   Emission
0          2  Afghanistan       5058          7225  1990   178.4682
1          2  Afghanistan       5058        724413  1990  4997.1108
2          2  Afghanistan       5058        723113  1990  4997.1108
3          2  Afghanistan       5059          7225  1990     8.5165
4          2  Afghanistan       5059          7230  1990     0.3046

In [102]:
#Save the df into a CSV
Emission_df.to_csv("Emissions.csv",header=True,index=False,mode="w")

In [103]:
#Check the no of rows
Emission_df.count()

Area_Code       905640
Area            905640
Item_Code       905640
Element_Code    905640
Year            905640
Emission        905640
dtype: int64

# Create Database Engine and Load tables into Postgres

In [55]:
#Create the engine
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/emission-population"
engine = create_engine(db_string)

In [65]:
#Creating the table Area & Populating it
Area_table_df.to_sql(name='Area', con=engine, if_exists='replace')

In [66]:
#Creating the table Item & Populating it
Item_table_df.to_sql(name='Item', con=engine, if_exists='replace')

In [67]:
#Creating the table Element & Populating it
Element_table_df.to_sql(name='Element', con=engine, if_exists='replace')

In [68]:
#Creating the table Emission & Populating it
Emission_table_df.to_sql(name='Emission', con=engine, if_exists='replace')

# Sample SQL Query to run using SqlAlchemy

In [60]:
#Retrieving the table data & metadata from pgadmin to the program
import sqlalchemy as db
metadata = db.MetaData()
emission=db.Table('Emission', metadata, autoload=True, autoload_with=engine)

In [61]:
# Print the column names
print(emission.columns.keys())

['Area_Code', 'Item_Code', 'Element_Code', 'Year', 'Emission']

In [62]:
#Executing the query
query = db.select([emission])
Result = engine.execute(query)
ResultSet = Result.fetchall()
ResultSet[:5]

[(1, 1707, 7225, 1990, 0.0),
 (1, 1707, 7225, 1991, 0.0),
 (1, 1707, 7225, 1992, 0.0204),
 (1, 1707, 7225, 1993, 0.0204),
 (1, 1707, 7225, 1994, 0.0204)]

In [64]:
#Moving the results to a data frame
df=pd.DataFrame(ResultSet)
print(emission.columns.keys())
df.head()

['Area_Code', 'Item_Code', 'Element_Code', 'Year', 'Emission']

   0     1     2     3       4
0  1  1707  7225  1990  0.0000
1  1  1707  7225  1991  0.0000
2  1  1707  7225  1992  0.0204
3  1  1707  7225  1993  0.0204
4  1  1707  7225  1994  0.0204